###################################################################

# Created by write_sdc on Fri Mar 22 23:22:26 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.1 [get_ports {o_outbuf_data_wr_rdy[3]}]
set_load -pin_load 0.1 [get_ports {o_outbuf_data_wr_rdy[2]}]
set_load -pin_load 0.1 [get_ports {o_outbuf_data_wr_rdy[1]}]
set_load -pin_load 0.1 [get_ports {o_outbuf_data_wr_rdy[0]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[31]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[30]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[29]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[28]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[27]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[26]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[25]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[24]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[23]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[22]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[21]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[20]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[19]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[18]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[17]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[16]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[15]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[14]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[13]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[12]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[11]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[10]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[9]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[8]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[7]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[6]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[5]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[4]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[3]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[2]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[1]}]
set_load -pin_load 0.1 [get_ports {o_oacts_read_data[0]}]
create_clock [get_ports clk]  -name clk  -period 1  -waveform {0 0.5}  -add
set_clock_uncertainty -setup 0.15  [get_clocks clk]
set_false_path   -from [get_ports rst_n]
set_input_delay -clock clk  0.2  [get_ports rst_n]
set_input_delay -clock clk  0.2  [get_ports i_feather_top_en]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_zp[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_zp[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_zp[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_zp[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_zp[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_zp[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_zp[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_zp[0]}]
set_input_delay -clock clk  0.2  [get_ports i_iacts_zp_valid]
set_input_delay -clock clk  0.2  [get_ports {i_weights_zp[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_zp[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_zp[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_zp[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_zp[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_zp[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_zp[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_zp[0]}]
set_input_delay -clock clk  0.2  [get_ports i_weights_zp_valid]
set_input_delay -clock clk  0.2  [get_ports i_weights_write_valid]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[31]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[30]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[29]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[28]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[27]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[26]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[25]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[24]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[23]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[22]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[21]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[20]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[19]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[18]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[17]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[16]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[15]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[14]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[13]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[12]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[11]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[10]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[9]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[8]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_data[0]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_addr[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_addr[0]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_addr_end[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_weights_write_addr_end[0]}]
set_input_delay -clock clk  0.2  [get_ports i_iacts_write_valid]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[31]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[30]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[29]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[28]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[27]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[26]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[25]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[24]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[23]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[22]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[21]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[20]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[19]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[18]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[17]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[16]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[15]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[14]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[13]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[12]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[11]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[10]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[9]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[8]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_data[0]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_addr[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_addr[0]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_addr_end[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_iacts_write_addr_end[0]}]
set_input_delay -clock clk  0.2  [get_ports i_instr_write_valid]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[11]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[10]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[9]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[8]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_data[0]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_addr[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_instr_write_addr[0]}]
set_input_delay -clock clk  0.2  [get_ports {i_all_buf_pingpong_config[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_all_buf_pingpong_config[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_all_buf_pingpong_config[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_all_buf_pingpong_config[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_all_buf_pingpong_config[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_all_buf_pingpong_config[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_all_buf_pingpong_config[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_all_buf_pingpong_config[0]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[15]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[14]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[13]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[12]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[11]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[10]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[9]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[8]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_outbuf_wr_instr[0]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[31]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[30]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[29]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[28]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[27]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[26]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[25]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[24]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[23]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[22]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[21]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[20]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[19]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[18]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[17]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[16]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[15]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[14]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[13]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[12]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[11]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[10]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[9]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[8]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_scale_val[0]}]
set_input_delay -clock clk  0.2  [get_ports i_oacts_read_valid]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr[0]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr_end[7]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr_end[6]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr_end[5]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr_end[4]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr_end[3]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr_end[2]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr_end[1]}]
set_input_delay -clock clk  0.2  [get_ports {i_oacts_read_addr_end[0]}]
set_output_delay -clock clk  0.2  [get_ports {o_outbuf_data_wr_rdy[3]}]
set_output_delay -clock clk  0.2  [get_ports {o_outbuf_data_wr_rdy[2]}]
set_output_delay -clock clk  0.2  [get_ports {o_outbuf_data_wr_rdy[1]}]
set_output_delay -clock clk  0.2  [get_ports {o_outbuf_data_wr_rdy[0]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[31]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[30]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[29]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[28]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[27]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[26]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[25]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[24]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[23]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[22]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[21]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[20]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[19]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[18]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[17]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[16]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[15]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[14]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[13]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[12]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[11]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[10]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[9]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[8]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[7]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[6]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[5]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[4]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[3]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[2]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[1]}]
set_output_delay -clock clk  0.2  [get_ports {o_oacts_read_data[0]}]
