# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line

create_rc_corner -name rc_tt  -qx_tech_file {/usr/scratch/jianming/pnr_sixu_jianming_oct/qrcTechFile_rctypical}


create_op_cond -name op_tt -P {1} -V {0.8} -T {25}   -library_file /usr/scratch/TSMC_LIB/tcbn28hpcplusbwp30p140_190a/tcbn28hpcplusbwp30p140_190a/TSMCHOME/digital/Front_End/timing_power_noise/NLDM/tcbn28hpcplusbwp30p140_180a/tcbn28hpcplusbwp30p140tt0p8v25c.lib

create_library_set -name lib_tt -timing { \
    /usr/scratch/TSMC_LIB/tcbn28hpcplusbwp30p140_190a/tcbn28hpcplusbwp30p140_190a/TSMCHOME/digital/Front_End/timing_power_noise/NLDM/tcbn28hpcplusbwp30p140_180a/tcbn28hpcplusbwp30p140tt0p8v25c.lib
}

create_constraint_mode -name cons -sdc_files {/usr/scratch/jianming/pnr_sixu_jianming_oct/SDC/lambda_top.sdc}

create_delay_corner -name dc_tt -library_set {lib_tt} -rc_corner {rc_tt} -opcond {op_tt}



create_analysis_view -name view_tt -constraint_mode {cons} -delay_corner {dc_tt}

set_analysis_view -setup {view_tt} -hold {view_tt}
